Перем Счетчик;
Перем ЭлементыВладельцаФормы;

Процедура ДеревоОбъектовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Колонка.Имя = "ОткрытьВПроводнике" Тогда
		Файл = Новый Файл(ВыбраннаяСтрока.ПолноеИмя);
		ОткрытьВПроводнике(Файл);
	ИначеЕсли Колонка.Имя = "ОткрытьВБлокноте" И ВыбраннаяСтрока.ИндексКартинки <> 1  Тогда
			WS = Новый COMОбъект("WScript.Shell");
			WS.Run("Notepad " + ВыбраннаяСтрока.ПолноеИмя, 10);
	ИначеЕсли ВыбраннаяСтрока.ИндексКартинки <> 1 Тогда
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(ВыбраннаяСтрока.ПолноеИмя, КодировкаТекста.UTF8);
		ЭлементыВладельцаФормы.ПолеТекстовогоДокумента1.УстановитьТекст(Текст.ПолучитьТекст());
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДеревоОбъектовПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.Имя.ОтображатьКартинку=истина;
	ОформлениеСтроки.Ячейки.Имя.ИндексКартинки=ДанныеСтроки.ИндексКартинки;
	Если ДанныеСтроки.ИндексКартинки=1 Тогда
		ОформлениеСтроки.Ячейки.ОткрытьВБлокноте.ОтображатьКартинку=ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДеревоОбъектовПриАктивизацииСтроки(Элемент)
	Если Элемент = ЭлементыФормы.ДеревоОбъектов Тогда
		Дерево =  ЭтаФорма.ВладелецФормы.ДеревоМетаданных;
		Гиперссылка = ЭлементыФормы.ОбъектМетаданных
	ИначеЕсли Элемент = ЭлементыФормы.ДеревоОбъектов1 Тогда
		Дерево = ЭтаФорма.ВладелецФормы.ДеревоCf;
		Гиперссылка = ЭлементыФормы.ОбъектМетаданных1;
	Иначе
		Дерево = ЭтаФорма.ВладелецФормы.ТретьеДерево;
		Гиперссылка = ЭлементыФормы.ОбъектМетаданных2;
	КонецЕсли;
	Если Открытие = Ложь Тогда
		Если Элемент.ТекущаяСтрока <> Неопределено Тогда
			Если  Элемент.ТекущаяСтрока.Родитель = Неопределено  Тогда
				СтрокаОбъекта = Дерево.Строки.Найти(Элемент.ТекущаяСтрока.Имя, "ПутьТекОбъект", Истина);
				Если СтрокаОбъекта <> Неопределено Тогда
					Гиперссылка.Заголовок = СтрокаОбъекта.Синоним;
					Гиперссылка.Гиперссылка = Истина;
				Иначе 	Гиперссылка.Заголовок = "Объект не найден";
					Гиперссылка.Гиперссылка = Ложь;
				КонецЕсли;
			Иначе СтрокаОбъекта = Дерево.Строки.Найти(Элемент.ТекущаяСтрока.Родитель.Имя, "ПутьТекОбъект", Истина);
				Если СтрокаОбъекта <> Неопределено Тогда
					Гиперссылка.Заголовок = СтрокаОбъекта.Синоним;
					Гиперссылка.Гиперссылка = Истина;
				Иначе 	Гиперссылка.Заголовок = "Объект не найден";
					Гиперссылка.Гиперссылка = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если РежимСравнения = 1 И Счетчик = Неопределено Тогда
			Счетчик = 1;
		Иначе
			Открытие = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектМетаданныхНажатие(Элемент)
	Если Элемент = ЭлементыФормы.ОбъектМетаданных Тогда
		Если РежимСравнения = 1 Тогда
			ЭлементыВладельцаФормы.ПанельДляДерева.ТекущаяСтраница = ЭлементыВладельцаФормы.ПанельДляДерева.Страницы.ДеревоCfu;
		КонецЕсли;
		ЭлементыВладельцаФормы.ДеревоМетаданных.ТекущаяСтрока = ЭлементыВладельцаФормы.ДеревоМетаданных.Значение.Строки.Найти(Элемент.Заголовок,"Синоним", Истина);
	Иначе
		ЭлементыВладельцаФормы.ПанельДляДерева.ТекущаяСтраница = ЭлементыВладельцаФормы.ПанельДляДерева.Страницы.ДеревоCf;
		ЭлементыВладельцаФормы.ДеревоCf.ТекущаяСтрока = ЭлементыВладельцаФормы.ДеревоCf.Значение.Строки.Найти(Элемент.Заголовок,"Синоним", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура КонтекстноеМенюСортироватьПоВыделенному(Кнопка)
	ИмяТекКолонки = ЭтаФорма.ТекущийЭлемент.ТекущаяКолонка.Имя;
	ЭтаФорма.ТекущийЭлемент.Значение.Строки.Сортировать("" + ИмяТекКолонки + " возр", Истина);
КонецПроцедуры

Процедура КонтекстноеМенюСортироватьПоВыделенному1(Кнопка)
	ИмяТекКолонки = ЭтаФорма.ТекущийЭлемент.ТекущаяКолонка.Имя;
	ЭтаФорма.ТекущийЭлемент.Значение.Строки.Сортировать("" + ИмяТекКолонки + " убыв", Истина);
КонецПроцедуры

Процедура КонтекстноеМенюВосстановитьПоУмолчанию(Кнопка)
	ЭтаФорма.ТекущийЭлемент.Значение.Строки.Сортировать("ИндексКартинки убыв, Имя возр");
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ЭлементыВладельцаФормы.УправляющаяКоманднаяПанель.Кнопки.ОткрытьНавигаторФайлов.Доступность = Истина;
КонецПроцедуры

ЭлементыВладельцаФормы = ЭтаФорма.ВладелецФормы.ЭлементыФормы;
