
Процедура ПриОткрытии()
	Картинка = Новый Картинка(Реквизит, Истина);
	ЭтаФорма.ЭлементыФормы.ФорматКартинки.Заголовок = "Тип картинки: " + Картинка.Формат();
	ЭтаФорма.ЭлементыФормы.ПолеКартинки1.Картинка = Картинка;
КонецПроцедуры

Процедура СохранитьВФайл(Кнопка)
	Рисунок = ЭтаФорма.ЭлементыФормы.ПолеКартинки1.Картинка;
	Если ЭлементыФормы.ПолеКартинки1.Картинка.Формат() = ФорматКартинки.BMP Тогда Фильтр="BMP (*.bmp)|*.bmp"
	ИначеЕсли ЭлементыФормы.ПолеКартинки1.Картинка.Формат() = ФорматКартинки.JPEG Тогда Фильтр="JPEG (*.jpg)|*.jpg"
	ИначеЕсли ЭлементыФормы.ПолеКартинки1.Картинка.Формат() = ФорматКартинки.Icon Тогда Фильтр="ICO (*.ico)|*.ico"
	ИначеЕсли ЭлементыФормы.ПолеКартинки1.Картинка.Формат() = ФорматКартинки.PNG Тогда Фильтр = "PNG (*.png)|*.png"
	ИначеЕсли ЭлементыФормы.ПолеКартинки1.Картинка.Формат() = ФорматКартинки.GIF Тогда Фильтр = "GIF (*.gif)|*.gif"
	ИначеЕсли ЭлементыФормы.ПолеКартинки1.Картинка.Формат() = ФорматКартинки.TIFF Тогда Фильтр="TIFF (*.tif)|*.tif"
	Иначе Фильтр=""
	КонецЕсли;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Фильтр = Фильтр;
	ДиалогВыбора.Заголовок = "Сохранить как...";
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайлаРезультата = ДиалогВыбора.ПолноеИмяФайла;
		ЭлементыФормы.ПолеКартинки1.Картинка.Записать(ИмяФайлаРезультата);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗакрытии()
	Для д = 0 По КоллекцияВременныхФайлов.Количество() - 1 Цикл
		УдалитьФайлы(КоллекцияВременныхФайлов[д].ПолноеИмя);
	КонецЦикла;
	КоллекцияВременныхФайлов.Очистить();
КонецПроцедуры

